src_ext/InformationRegisters/УЗ_ГраницаПросмотраКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ГраницаПросмотраКассы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ДатыЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ДатыЗапрета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретСтаршеДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/CommonModules/УЗ_ДатыЗапрета/Ext/Module.bsl
//Даты запрета изменения документов учёта занятий — своя замена подсистемы БСП.
//
//Настройка — регистр УЗ_ДатыЗапрета (раздел «Настройки»):
//  Пользователь      — для кого; пустой — для всех. Своя строка пользователя важнее общей:
//                      так администратор снимает или сдвигает запрет для себя;
//  ДатаЗапрета       — документы с этой датой и раньше менять нельзя (включительно);
//  ЗапретСтаршеДней  — скользящая граница «сегодня минус N дней» (бывшая галка LM
//                      «ДатаЗапретаРедактированияНеделя» = 7). Как и в LM, скользящая граница
//                      не действует на пользователя с правом администрирования; фиксированная
//                      дата действует на всех, как даты запрета БСП.
//Из двух границ действует более поздняя.
//
//Проверка — подписки УЗ_ДатаЗапретаПередЗаписью / УЗ_ДатаЗапретаПередУдалением на все
//документы УЗ_ (одна точка на все документы; новый документ добавить в источники подписок —
//тест тест_даты_запрета.py сверяет состав). Запись включает проведение и пометку удаления.
//Перенос документа из закрытого периода в открытый тоже запрещён: проверяется и прежняя
//дата из базы. Загрузка обменом (ОбменДанными.Загрузка) не проверяется.

//Граница запрета для пользователя: последний запрещённый день (включительно) или пустая дата.
//Пользователь не задан — текущий пользователь сеанса.
Функция ДатаЗапрета(Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;
	Правило = ПравилоЗапрета(Пользователь);

	Граница = Правило.ДатаЗапрета;
	Если Правило.ЗапретСтаршеДней > 0 И НЕ ЭтоАдминистратор(Пользователь) Тогда
		//старше N дней: разрешён день «сегодня − N», запрещён день перед ним
		Скользящая = НачалоДня(ТекущаяДатаСеанса()) - (Правило.ЗапретСтаршеДней + 1) * 86400;
		Граница = Макс(Граница, Скользящая);
	КонецЕсли;
	Возврат Граница;

КонецФункции

//Истина — объект (документ) нельзя записать или удалить из-за даты запрета.
Функция ИзменениеЗапрещено(Объект) Экспорт

	Возврат ПричинаЗапрета(Объект) <> "";

КонецФункции

//Текст причины запрета для пользователя или пустая строка, если менять можно.
Функция ПричинаЗапрета(Объект) Экспорт

	Граница = ДатаЗапрета();
	Если НЕ ЗначениеЗаполнено(Граница) Тогда
		Возврат "";
	КонецЕсли;
	Граница = КонецДня(Граница);

	ПроверяемаяДата = Объект.Дата;
	Если НЕ Объект.ЭтоНовый() Тогда
		ПрежняяДата = ПрежняяДатаДокумента(Объект.Ссылка);
		Если ЗначениеЗаполнено(ПрежняяДата) И ПрежняяДата < ПроверяемаяДата Тогда
			ПроверяемаяДата = ПрежняяДата;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПроверяемаяДата) Или ПроверяемаяДата > Граница Тогда
		Возврат "";
	КонецЕсли;

	Возврат СтрШаблон(НСтр("ru = 'Документ от %1 в закрытом периоде: изменять и удалять документы по %2 включительно запрещено (Настройки → Даты запрета изменения).'"),
		Формат(ПроверяемаяДата, "ДЛФ=D"), Формат(Граница, "ДЛФ=D"));

КонецФункции

//Обработчик подписки УЗ_ДатаЗапретаПередЗаписью.
Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Причина = ПричинаЗапрета(Источник);
	Если Причина <> "" Тогда
		Отказ = Истина;
		СообщитьОЗапрете(Причина);
	КонецЕсли;

КонецПроцедуры

//Обработчик подписки УЗ_ДатаЗапретаПередУдалением.
Процедура ПередУдалениемДокумента(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Причина = ПричинаЗапрета(Источник);
	Если Причина <> "" Тогда
		Отказ = Истина;
		СообщитьОЗапрете(Причина);
	КонецЕсли;

КонецПроцедуры

//Для форм документов: в ПриЧтенииНаСервере. Запрещённый документ открывается только для
//просмотра, над формой — красная строка с причиной.
Процедура ФормаПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт

	Причина = ПричинаЗапрета(ТекущийОбъект);
	Если Причина = "" Тогда
		Возврат;
	КонецЕсли;

	Форма.ТолькоПросмотр = Истина;
	Пояснение = Форма.Элементы.Найти("УЗ_ПояснениеЗапрета");
	Если Пояснение = Неопределено Тогда
		Пояснение = Форма.Элементы.Добавить("УЗ_ПояснениеЗапрета", Тип("ДекорацияФормы"));
		Пояснение.Вид = ВидДекорацииФормы.Надпись;
		Пояснение.ЦветТекста = Новый Цвет(178, 34, 34);
		Пояснение.АвтоМаксимальнаяШирина = Ложь;
		Если Форма.ПодчиненныеЭлементы.Количество() > 1 Тогда
			Форма.Элементы.Переместить(Пояснение, Форма, Форма.ПодчиненныеЭлементы[0]);
		КонецЕсли;
	КонецЕсли;
	Пояснение.Заголовок = Причина;

КонецПроцедуры

//Для журналов и отчётов менеджеров: первый день, который пользователю можно смотреть,
//если на него действует скользящий запрет (в LM — «менеджер видит только неделю»).
//Пустая дата — ограничения нет. Это отбор форм по правилу пользователя (своя строка важнее общей);
//ограничение доступа роли менеджера держит границу из регистра УЗ_ГраницаПросмотраКассы (ниже).
Функция ГраницаПросмотра() Экспорт

	Пользователь = УЗ_Среда.ТекущийПользователь();
	Правило = ПравилоЗапрета(Пользователь);
	Если Правило.ЗапретСтаршеДней = 0 Или ЭтоАдминистратор(Пользователь) Тогда
		Возврат '00010101';
	КонецЕсли;
	Возврат НачалоДня(ТекущаяДатаСеанса()) - Правило.ЗапретСтаршеДней * 86400;

КонецФункции

#Область ГраницаПросмотраКассы

//Граница просмотра кассы для ограничения доступа роли менеджера (S04) — регистр УЗ_ГраницаПросмотраКассы,
//одна запись: НачалоПросмотра — первый день, приход, расход и перемещение денег которого менеджеру видны
//(в списках, формах, журналах, запросах и «Все функции»); ДатаРасчета — на какой день она посчитана.
//Условие роли — подзапрос к регистру, без параметров сеанса: так оно действует в любом сеансе — клиент,
//COM/внешнее соединение, фоновые и регламентные задания, HTTP. Прежний параметр сеанса
//УЗ_НачалоПросмотраКассы ставил только модуль приложения, и сеанс без клиента падал «Попытка получения
//неинициализированного значения параметра сеанса» (модуль сеанса в безопасном режиме расширения не работает).
//Граница одна на всех — по ОБЩЕЙ строке дат запрета (пустой пользователь): «старше N дней» → сегодня − N дней,
//N = 0 или строки нет — пустая дата (видно всё). Своя строка пользователя меняет его запрет изменения и отбор
//форм (ГраницаПросмотра), но не ограничение роли: в условии роли нет текущего пользователя.
//Записи нет — менеджер кассовых документов не видит вовсе (строже, а не шире): запись ставят шаг обновления
//данных, регламентное задание УЗ_ОбновлениеГраницыПросмотраКассы раз в сутки и вход в программу.

//Граница по общему правилу на день Сегодня (начало дня).
Функция НачалоПросмотраКассы(Сегодня) Экспорт

	Правило = ПравилоЗапрета(Справочники.Пользователи.ПустаяСсылка());
	Если Правило.ЗапретСтаршеДней = 0 Тогда
		Возврат '00010101';
	КонецЕсли;
	Возврат НачалоДня(Сегодня) - Правило.ЗапретСтаршеДней * 86400;

КонецФункции

//Регламентное задание УЗ_ОбновлениеГраницыПросмотраКассы, шаг обновления данных 4 и вход в программу
//(УЗ_Сервер.ПриНачалеРаботы). Пишет запись, только если наступил новый день или сменилось общее правило —
//при повторном вызове в тот же день одно чтение.
Процедура ОбновитьГраницуПросмотраКассы() Экспорт

	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	Граница = НачалоПросмотраКассы(Сегодня);
	Запись = РегистрыСведений.УЗ_ГраницаПросмотраКассы.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	Если Запись.Выбран() И Запись.ДатаРасчета = Сегодня И Запись.НачалоПросмотра = Граница Тогда
		Возврат;
	КонецЕсли;
	Запись.НачалоПросмотра = Граница;
	Запись.ДатаРасчета = Сегодня;
	Запись.Записать();

КонецПроцедуры

//Граница, записанная в регистре (Неопределено — записи нет): для тестов и проверок.
Функция ЗаписаннаяГраницаПросмотраКассы() Экспорт

	Запись = РегистрыСведений.УЗ_ГраницаПросмотраКассы.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("НачалоПросмотра, ДатаРасчета", Запись.НачалоПросмотра, Запись.ДатаРасчета);

КонецФункции

#КонецОбласти

//Документы УЗ_, которых нет в источниках подписок (для теста состава). Пустой массив — всё покрыто.
Функция ДокументыБезПроверки() Экспорт

	Итог = Новый Массив;
	ПередЗаписью = Метаданные.ПодпискиНаСобытия.УЗ_ДатаЗапретаПередЗаписью.Источник;
	ПередУдалением = Метаданные.ПодпискиНаСобытия.УЗ_ДатаЗапретаПередУдалением.Источник;
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		Если СтрНачинаетсяС(ОбъектМетаданных.Имя, "УЗ_") Тогда
			ТипОбъекта = Тип("ДокументОбъект." + ОбъектМетаданных.Имя);
			Если НЕ ПередЗаписью.СодержитТип(ТипОбъекта) Или НЕ ПередУдалением.СодержитТип(ТипОбъекта) Тогда
				Итог.Добавить(ОбъектМетаданных.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

Функция ПравилоЗапрета(Пользователь)

	Правило = Новый Структура("ДатаЗапрета, ЗапретСтаршеДней", '00010101', 0);
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	СписокПользователей = Новый Массив;
	СписокПользователей.Добавить(ПустойПользователь);
	Если ЗначениеЗаполнено(Пользователь) Тогда
		СписокПользователей.Добавить(Пользователь);
	КонецЕсли;

	//настройку читают все, менять её сотрудникам не дано — чтение в привилегированном режиме
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Даты.Пользователь КАК Пользователь,
	|	Даты.ДатаЗапрета КАК ДатаЗапрета,
	|	Даты.ЗапретСтаршеДней КАК ЗапретСтаршеДней
	|ИЗ
	|	РегистрСведений.УЗ_ДатыЗапрета КАК Даты
	|ГДЕ
	|	Даты.Пользователь В (&Пользователи)";
	Запрос.УстановитьПараметр("Пользователи", СписокПользователей);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);

	НайденаСвоя = Ложь;
	Пока Выборка.Следующий() Цикл
		ЭтоСвоя = Выборка.Пользователь <> ПустойПользователь;
		Если ЭтоСвоя Или НЕ НайденаСвоя Тогда
			Правило.ДатаЗапрета = Выборка.ДатаЗапрета;
			Правило.ЗапретСтаршеДней = Выборка.ЗапретСтаршеДней;
			НайденаСвоя = ЭтоСвоя;
		КонецЕсли;
	КонецЦикла;
	Возврат Правило;

КонецФункции

//Администратор — пользователь ИБ с правом администрирования. Для другого пользователя
//(не текущего) ответ по текущему сеансу не годится: ищем его пользователя ИБ.
Функция ЭтоАдминистратор(Пользователь)

	Если Пользователь = УЗ_Среда.ТекущийПользователь() Тогда
		Возврат ПравоДоступа("Администрирование", Метаданные);
	КонецЕсли;
	Возврат Ложь;

КонецФункции

Функция ПрежняяДатаДокумента(Ссылка)

	//читаем из базы, а не через Ссылка.Дата: ссылка отдаёт закэшированные реквизиты
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ
	|	Т.Дата КАК Дата
	|ИЗ
	|	%1 КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка", Ссылка.Метаданные().ПолноеИмя());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	КонецЕсли;
	Возврат '00010101';

КонецФункции

Процедура СообщитьОЗапрете(Причина)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Причина;
	Сообщение.Сообщить();

КонецПроцедуры
